#- Напишите программу, которая принимает на вход
# вещественное число и показывает сумму его цифр.
# Учтите, что числа могут быть отрицательными
num=input('Введите вещественное число:')
number=0
for i in num:
    if i.isdigit():
        number += int(i)
print(number)

    